app/controllers/concepts_controller.rb

  def index
    @concepts = Concept.all
---
SELECT "concepts".* FROM "concepts"