app/controllers/infractions_controller.rb

SELECT "infractions".* FROM "infractions"
---
  def index
    @infractions = Infraction.all

INSERT INTO "infractions" ("nombre", "placa", "raking_honestidad", "raking_trato", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nombre", "chuchito"], ["placa", "1"], ["raking_honestidad", 2], ["raking_trato", 2], ["created_at", "2015-03-07 23:30:05.479627"], ["updated_at", "2015-03-07 23:30:05.479627"]]
---
  def create
    @infraction = Infraction.new(infraction_params)

    respond_to do |format|
      if @infraction.save

DELETE FROM "infractions" WHERE "infractions"."id" = ?  [["id", 1]]
---
  def destroy
    @infraction.destroy

SELECT  "infractions".* FROM "infractions" WHERE "infractions"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_infraction
      @infraction = Infraction.find(params[:id])